Messwerte/Archiv/Raw/apache_benchmark_repeat35/max/default/tomcat/target_count_3/repeat_5/2.txt
2020/01/23 08:23:20 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8002/
2020/01/23 08:23:50 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Completed 100000 requests
Completed 200000 requests
Finished 238222 requests
Server Software:        
Server Hostname:        192.168.3.100
Server Port:            8002
Document Path:          /
Document Length:        713 bytes
Concurrency Level:      100
Time taken for tests:   30.000 seconds
Complete requests:      238222
Failed requests:        0
Non-2xx responses:      238226
Total transferred:      206780168 bytes
HTML transferred:       169855138 bytes
Requests per second:    7940.72 [#/sec] (mean)
Time per request:       12.593 [ms] (mean)
Time per request:       0.126 [ms] (mean, across all concurrent requests)
Transfer rate:          6731.12 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    7  48.7      5    1037
Processing:     0    6  11.1      4     261
Waiting:        0    5  10.7      4     261
Total:          0   13  49.9      9    1042
Percentage of the requests served within a certain time (ms)
  50%      9
  66%     11
  75%     11
  80%     12
  90%     14
  95%     16
  98%     21
  99%     35
 100%   1042 (longest request)
{"connect":{"max":1037,"mean":7,"median":5,"min":0,"stdDev":48.70000076293945},"percentiles":{"100":1042,"50":9,"66":11,"75":11,"80":12,"90":14,"95":16,"98":21,"99":35},"processing":{"max":261,"mean":6,"median":4,"min":0,"stdDev":11.100000381469727},"total":{"max":1042,"mean":13,"median":9,"min":0,"stdDev":49.900001525878906},"waiting":{"max":261,"mean":5,"median":4,"min":0,"stdDev":10.699999809265137}}
2020/01/23 08:23:50 Matched stat line [Connect:        0    7  48.7      5    1037 Connect 0 7 48.7 5 1037]
2020/01/23 08:23:50 Matched stat line [Processing:     0    6  11.1      4     261 Processing 0 6 11.1 4 261]
2020/01/23 08:23:50 Matched stat line [Waiting:        0    5  10.7      4     261 Waiting 0 5 10.7 4 261]
2020/01/23 08:23:50 Matched stat line [Total:          0   13  49.9      9    1042 Total 0 13 49.9 9 1042]
2020/01/23 08:23:50 Matched percentline [  50%      9 50 9]
2020/01/23 08:23:50 Matched percentline [  66%     11 66 11]
2020/01/23 08:23:50 Matched percentline [  75%     11 75 11]
2020/01/23 08:23:50 Matched percentline [  80%     12 80 12]
2020/01/23 08:23:50 Matched percentline [  90%     14 90 14]
2020/01/23 08:23:50 Matched percentline [  95%     16 95 16]
2020/01/23 08:23:50 Matched percentline [  98%     21 98 21]
2020/01/23 08:23:50 Matched percentline [  99%     35 99 35]
2020/01/23 08:23:50 Matched percentline [ 100%   1042 100 1042]